<HTML>	<HEAD> 		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">		<TITLE>Konfigurere et layout</TITLE>		<META NAME="Copyright" CONTENT="Copyright 2005 Mesa Dynamics, LLC">		<META NAME="DESCRIPTION" CONTENT="Konfigurere et layout i Amnesty">	</HEAD>	<BODY BGCOLOR="#ffffff">		<IMG SRC="gfx/no_icon.jpg" WIDTH="64" HEIGHT="64"><p>		<FONT SIZE="3" FACE="Lucida Grande,Geneva,Arial"><b>Konfigurere et layout</b></font>		<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial"><p>		<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial"><p>			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#fff8dc">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">V&aelig;lg <b>Konfigurer</b> i layout-undermenuen.			</FONT></TD>				</TR>			</TABLE></P><b>Genvejstast</b></p><p>En genvejstast er en tastekombination, der &aring;bner eller lukket et layout p&aring; et vilk&aring;rlig tidspunkt, uanset hvilket program der er &aring;bent.</p><p>N&aring;r man trykker p&aring; genvejstasten, vil de widgeter, der h&oslash;rer til det nuv&aelig;rende layout (hvis der er nogen) forsvinde fra sk&aelig;rmen, og de widgeter, der h&oslash;rer til layoutet, blive vist i stedet. Hvis dette layout allerede er synligt, vil det i stedet blive skjult, n&aring;r der trykkes p&aring; tastaturgenvejen.</p><p>NB! &AElig;ndringer i tastaturgenvejen virker f&oslash;rst, n&aelig;ste gang Amnesty &aring;bnes.</p>	<b>Vis en baggrund bag flydende widgeter</b></p><p>	N&aring;r et layout &aring;bnes, kan der vises en baggrund bag alle dets flydende widgeter. Det kan g&oslash;re et layout mere tydeligt ved at skabe kontrast til de widgeter, der vises.<ul><p><b>Farve</b>. Klik p&aring; farvecirklen for at v&aelig;lge, hvilken farve der skal bruges som baggrund for layoutet.</p><p><b>Billede</b>. Tr&aelig;k og slip en lokal billedfil p&aring; kassen for at bruge den som baggrund for layoutet i stedet for en farve. Tryk p&aring; slettetasten for at vende tilbage til at bruge en farve.</p><p><b>Gennemsigtighed</b>. Brug denne skyder til at &aelig;ndre gennemsigtigheden af layoutets baggrund: Fra n&aelig;sten usynlig til helt ugennemsigtig.</p></ul></p><b>Gem ikke &aelig;ndringer i widgeters synlighed</b></p><p>Hvis afkrydset, vil synligheden af widgeter i layoutet ikke blive p&aring;virket, n&aring;r en widget &aring;bnes eller lukkes i layoutet.<p>		Dette giver mulighed for at "l&aring;se" et layout, s&aring;ledes at det er de samme widgeter, der vises, hver gang layoutet &aring;bnes.  <p>NB! Du har stadig mulighed for at &aring;bne og lukke widgeter; men disse handlinger gemmes ikke.</p>	</BODY></HTML>