<HTML>	<HEAD> 		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">		<TITLE>Arbejde med layout</TITLE>		<META NAME="Copyright" CONTENT="Copyright 2005 Mesa Dynamics, LLC">		<META NAME="DESCRIPTION" CONTENT="How to work with Layouts in Amnesty">	</HEAD>	<BODY BGCOLOR="#ffffff">		<IMG SRC="gfx/no_icon.jpg" WIDTH="64" HEIGHT="64"><p>		<FONT SIZE="3" FACE="Lucida Grande,Geneva,Arial"><b>Arbejde med flere layout</b></font>		<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial"><p>
		
Et <i>layout</i> er en skabelon, der holder orden p&aring; synlighed, placering og konfiguration af de widgeter, der er &aring;bnet i Amensty <i>Widget Browser</i>.
<p>T&aelig;nk for eksempel, at du &aring;bner en widget og placerer den p&aring; skrivebords-niveau i nederste venstre hj&oslash;rne af din sk&aelig;rm med 50% gennemsigtighed. N&aelig;ste gang, du &aring;bner Amnesty, vil denne widget blive &aring;bnet og indstillingerne husket. Det sker, fordi alle &aelig;ndringer, som du laver med en widget &mdash; &aring;bner, lukker og forandrer en widgets indstillinger &mdash; huskes i layoutet.

<p>Hvis du har en stor samling af widgeter eller kun har begr&aelig;nset sk&aelig;rmplads, hvor du kan s&aelig;tte dine widgeter, kan muligheden for at lave flere layout v&aelig;re k&aelig;rkommen; hvert layout kan gemme sine egne widgeter og indstillinger. For eksempel kan du have alle dine spilrelaterede widgeter i et "Spil"-layout og alle dine nyheds-relaterede i et andet, og bringe disse layout frem p&aring; sk&aelig;rmen, lige n&aring;r du vil.

<p>Du kan ogs&aring; have den samme widget i flere layout: en widget kan st&aring; i &oslash;verste h&oslash;jre hj&oslash;rne i et layout, nederste venstre i et andet og p&aring; skrivebordsniveau i et tredie. (NB! Samme widget i flere layoueter vil stadig have de samme interne indstillinger. Hvis du gerne vil komme uden om det, kan du se mere under <a href="advanced.htm">Avancerede tips &amp; tricks</a>).

<p>Layouter i Amnesty (og funktioner, der bruges til at kontrollere dem) er tilg&aelig;ngelige gennem Layout-undermenuen.<p> De f&oslash;lgende layout er indbyggede (og kan ikke slettes):

<ul>
<p><b>Standard.</b> Dette layout er aktivt, n&aring;r Amnesty startes f&oslash;rste gang. Hvis du ikke &aelig;ndrer layout, vil dette layout altid v&aelig;re det aktive.</p>

<p><b>Skjult.</b> Dette er et specielt layout, hvor alle widgeter er skjult. Widgeter kan ikke &aring;bnes eller vises, n&aring;r dette layout er aktivt.</p></ul>
Layout, der er oprettede af brugere, findes under overskifter <i>Brugerlayout</i>.

<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
			<P><br><b>&Aring;bning af layout</b><p>			<P>			</FONT>			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#fff8dc">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

V&aelig;lg navnet p&aring; et layout p&aring; layout-undermenuen
			</FONT></TD>				</TR>			</TABLE></P>
Widgeterne, der h&oslash;rer til det nuv&aelig;rende layout (om der er nogen) forsvinder fra sk&aelig;rmen, og de widgeter, der h&oslash;rer til det valgte layout, dukker op i stedet.

<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
			<P><br><b>Skjul det nuv&aelig;rende layout</b><p>			<P>			</FONT>			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#fff8dc">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

V&aelig;lg <b>Skjul</b> p&aring; layout-undermenuen. 
			</FONT></TD>				</TR>			</TABLE></P>
Det nuv&aelig;rende layout lukkes, og skjult-layoutet &aring;bner i stedet (s&aring;ledes at alle widgeter forsvinder fra sk&aelig;rmen).
<FONT SIZE="1" FACE="Lucida Grande,Geneva,Arial">
<p>NB! Alle widgeter i Amnesty-menuen vil v&aelig;re i<i>sl&aring;et-fra</i>-modus, n&aring;r det skjulte layout er &aring;bent.</font> 
<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
			<P><br><b>Vis det sidst &aring;bne layout</b><p>			<P>			</FONT>			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#fff8dc">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

V&aelig;lg <b>Vis</b> p&aring; layout-undermenuen. 
			</FONT></TD>				</TR>			</TABLE></P>
Det skjulte layout lukkes, og det sidst &aring;bne layout vises i stedet.<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
			<P><br><b>Lav et nyt layout</b><p>						</FONT>			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#fff8dc">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

V&aelig;lg <b>Gem layout som</b> p&aring; layout-undermenuen.			</FONT></TD>				</TR>			</TABLE></P>
Der dukker en dialogboks op, hvori du kan give det nye layout et navn. Det nye layout vil se ud som det nuv&aelig;rende layout og vil v&aelig;re tilg&aelig;ngeligt p&aring; layout-undermenuen.
			</FONT><p>
<FONT SIZE="1" FACE="Lucida Grande,Geneva,Arial">Tip: For at lave et nyt "tomt" layout, skift f&oslash;rst til det skjulte layout, inden du v&aelig;lger <b>Gem layout som</b>. Det skaber et nyt layout, hvor alle widgeter til at begynde med er skjult. Du kan nu &aring;bne og placere widgeter i det nye layout, som det passer dig.
</FONT>
<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
			<P><br><b>Slet det nuv&aelig;rende layout</b><p>			<P>			</FONT>			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#fff8dc">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

V&aelig;lg <b>Slet layout</b> p&aring; layout-undermenuen.			</FONT></TD>				</TR>			</TABLE></P>
<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
Der dukker en dialogboks op, hvor du bliver bedt om at bekr&aelig;ffte, at layoutet skal slettes. Denne handling kan ikke fortrydes. N&aring;r det nuv&aelig;rende layout er blevet slettet, &aring;bner det skjulte layout i stedet.
			</FONT>

<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
			<P><br><b>L&aelig;g widgeter forrest</b><p>			<P>
			Hvis du har placeret widgeter i det nuv&aelig;rende layout i forskellige niveauer, kan det v&aelig;re sv&aelig;rt at se, hvordan dit layout ser ud. Eller hvis du har gjort en widget "klik-igennem", har du ikke mulighed for at kontrol-klikke p&aring; den for at &aelig;ndre dens indstillinger yderligere. I begge tilf&aelig;lde vil problemerne v&aelig;re l&oslash;st, hvis du l&aelig;gger widgeter forrest.
</FONT>			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#fff8dc">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

V&aelig;lg <b>L&aelig;g Widgeter forrest</b> p&aring; layout-undermenuen.			</FONT></TD>				</TR>			</TABLE></P>
<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
Alle widgeter i det nuv&aelig;rende layout vil st&aring; frem p&aring; sk&aelig;rmen, uanset hvilket vinduesniveau de skulle have. Og alle widgeter, der er "klik-igennem" vil blive klikbare. Nu kan du unders&oslash;ge dit layout og &aelig;ndre alle widgeters indstillinger.<p>NB! Dette er en midlertidig modus. Hvis du skifter layout eller v&aelig;lger <b>L&aelig;g widgeter tilbage til layout</b> p&aring; layout-undermenuen, vil widgeterne vende tilbage til deres rigtige vinduesniveau og genantage deres "klik-igennem"-tilstand.
			</FONT>
	</BODY></HTML>