<HTML>	<HEAD> 		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">		<TITLE>Amnestys menu</TITLE>		<META NAME="Copyright" CONTENT="Copyright 2005 Mesa Dynamics, LLC">		<META NAME="DESCRIPTION" CONTENT="Hvordan bruges Amnestys menu">	</HEAD>	<BODY BGCOLOR="#ffffff">		<IMG SRC="gfx/no_icon.jpg" WIDTH="64" HEIGHT="64"><p>		<FONT SIZE="3" FACE="Lucida Grande,Geneva,Arial"><b>Amnestys menu</b></font>		<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial"><p>
		
Amnestymenuen, der er en lille sommerfugl i h&oslash;jre del af din menu-bar &oslash;verst p&aring; sk&aelig;rmen, er din prim&aelig;re adgang til Amnesty <i>Widget Browser</i>. <p>
N&aring;r Amnesty startes, indl&aelig;ser den widgeter fra Systemets widget-biblioteker og opbygger en liste over de widgeter, den finder. Hvis der ikke bliver fundet nogen widgeter, vil listen blot best&aring; af en enkelt linie <i>Ingen widgeter fundet</i>.
			</p>
<p>Amnestymenuen indeholder ogs&aring; emner, som du ikke finder i almindelige programmerts menu, s&aring;som <b>Hj&aelig;lp</b>, <b>Indstillinger</b>, <b>Afslut </b>og andre programfunktioner. 

<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
			<P><br><b>Installere en widget, s&aring; den kan bruges i Amnesty</b><p>			<P>
			Til Panter-brugere. Amnestys widget-bibliotek er det prim&aelig;re widget-bibliotek, og det er her, at widgeter skal installeres.<p> Til Tiger-brugere. Amnestys widget-bibliotek er et sted, hvor man har mulighed for at installere widgeter, der kun skal bruges af Amnesty.
			</FONT>			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#fff8dc">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

&Aring;bn Amnestys widget-bibliotek (~/Bibliotekt/Application Support/Amnesty/Widgets) i Finder eller tryk p&aring; <b>Vis i Finder</b>-knappen i Indstillinger-vinduet for at &aring;bne dette sted automatisk.
			</FONT></TD>				</TR>			</TABLE></P>
<p>I Finder kan du installere <i>.wdgt</i>-filer i (eller fjerne dem fra) denne mappe. 
			</FONT>			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#FFEEEE">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

<b>Specielt for Panther-brugere</b>: nogle widgeter er specifikt skrevet til at bruge teknologier, der kun er tilg&aelig;ngelige i Tiger. Disse widgeter vil muligvis slet ikke k&oslash;re under Panther. Mesa Dynamics har en hjemmeside, der oplyser om <i>kendte problemer</i>, hvor der oplyses om widgeter, der ikke k&oslash;rer i Panther. Denne side er tilg&aelig;ngelig gennem <b>kendte problemer</b>-emnet i <b>Hj&aelig;lp</b>-undermenuen. Hvis du ikke er sikker p&aring;, om en widget forventes at k&oslash;re i Panther, kan du se efter p&aring; denne side. <p>Apples standard widgeter i Dashboard (der er pr&aelig;installeret i Tiger) hverken underst&oslash;ttes eller er tilg&aelig;ngelige i Amnesty i Panther.
			</FONT></TD>				</TR>			</TABLE></P>
<p><br>
<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

<b>Genopbyg listen over widgeter</b>			<P>Hvis du installerer (eller fjerner widgeter), medens Amnesty k&oslash;rer, kan du tvinge widgetlisten til at blive opdateret p&aring; et vilk&oslash;rligt tidspunkt.
			</p>
						<P>			</FONT>			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#fff8dc">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

V&aelig;lg <b>Genopbyg widget-liste</b> fra Amnesty-menuen.

			</FONT></TD>				</TR>			</TABLE>		
	</BODY></HTML>