<HTML>	<HEAD> 		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">		<TITLE>Indstillinger</TITLE>		<META NAME="Copyright" CONTENT="Copyright 2005 Mesa Dynamics, LLC">		<META NAME="DESCRIPTION" CONTENT="Hvorledes indstilles Amnnesty">	</HEAD>	<BODY BGCOLOR="#ffffff">		<IMG SRC="gfx/no_icon.jpg" WIDTH="64" HEIGHT="64"><p>		<FONT SIZE="3" FACE="Lucida Grande,Geneva,Arial"><b> Indstillinger</b></font>		<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial"><p>
			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#fff8dc">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

V&aelig;lg <b>Indstillinger</b> fra Amnesty-menuen.
			</FONT></TD>				</TR>			</TABLE></P>
<b>Widgeter</b></p><p>	
En widget kan huske f&oslash;lgende indstillinger for hvert layout, den er i:
<ul>
<p><b>Synlighed</b>. Om widgeten er synlig eller ej i layoutet.</p>
<p><b>Placering</b>. Hvor p&aring; sk&aelig;rmen widgeten er placeret, n&aring;r den er synlig.</p>
<p><b>Konfiguration</b>. De forskellige indstillinger, der er tilgÊngelige i widgetens indstillings-vindue (gennemsigtighed, niveau m.v.).</p>
</ul>
N&aring; Amnesty startes, indl&aelig;ses widgeter fra op til tre biblioteker i f&oslash;lgende r&aelig;kkef&oslash;lge (hvis den samme widget findes i flere biblioteker, er det den widget, der findes f&oslash;rst, der bruges, og der ses bort fra de andre):
<ul>
<p><b>Amnesty</b>. Dette er Amnestys standard bibliotek til widgeter. I Tiger vil widgeter, der installeres her, ikke dukke op i Dahsboard.</p>
<p><b>Dashboard-bruger</b>. Her installeres tredie-parts widgeter af Dashboard. Dette katalog er ikke tilg&aelig;ngeligt i Panter. </p>
<p><b>Dashboard-standard</b>. Her installerer Dashboard de standard widgeter, der er udviklet af Apple. Dette katalog er ikke tilg&aelig;ngeligt i Panter. </p>
</ul>
</p>
<b>Generelt</b></p><p>		
<ul>
<p><b>K&oslash;r i modus med begr&aelig;nset CPU-forbrug</b>.
Nogle "h&oslash;j"-aktive widgeter (<i>f.eks.</i> dem med konstant animation) var af deres udviklere designet til kun at k&oslash;re, n&aring;r Dashboard var aktiv, og derfor ikke n&oslash;dvendigvis designet til at begr&aelig;nse deres forbrug af systemeressourcer. Denne modus hj&aelig;lper med til at kontrollere disse widgeter, hvad der kan v&aelig;re nyttigt, hvis de k&oslash;rer og er synlige hele tiden.
<p><b>Luk widgeter automatisk, n&aring;r de er skjult</b>. For at begr&aelig;nse brugen af hukommelse til et minimum, kan det v&aelig;re, at du foretr&aelig;kker automatisk at lukke de widgeter, der ikke er synlige.</p>
<p><b>&Aring;bn Amnesty med alle widgeter lukket</b>. Denne indstilling (hvor Amnesty &aring;bner med det skjulte layout aktivt), er nyttig, hvis du har sat Amnesty til at &aring;bne ved login, og du &oslash;nsker at holde widgeter skjult, indtil du direkte beder dem om andet (<i>f.eks.</i> ved at bruge genvejstasten eller Amnestys menu).</p>
</ul>
</p>
<b>Genvejstaster</b></p><p>		
</p>
Genvejstaster er tastekombinationer, der aktiverer funktioner i Amnesty p&aring; et vilk&aring;rligt tidspunkt, uagtet hvilkt andet program, der er aktivt.
<ul>
<p><b>Vis/skjul layout</b>. Dette svarer til at væ&aelig;lge <b>Skjul</b> eller <b>Vis</b> fra layout-undermenuen, og det vil skifte synligheden p&aring; det aktive layout.</p>
<p><b>Åbn Amnestys menu</b> (Kun i Tiger). Dette svarer til at klikke p&aring; Amnestys somemrfugl i menuen: menuen &aring;bner, og du kan v&aelig;lge emnerne med musen, piletasterne eller ved at bruge "forudsigelig indtastning" (<i>f. eks..</i> taste "kal" for at v&aelig;lge Kalender-widgeten og s&aring; trykke på <i>retur</i> for at &aring;bne den).</ul>NB: &AElig;ndringer i genvejstasterne registreres ikke, f&oslash;r Amnesty &aring;bnes n&aelig;ste gang.	</BODY></HTML>