<HTML>	<HEAD> 		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">		<TITLE>Arbejde med widgeter</TITLE>		<META NAME="Copyright" CONTENT="Copyright 2005 Mesa Dynamics, LLC">		<META NAME="DESCRIPTION" CONTENT="Hvordan man arbejder med widgeter i Amnesty">	</HEAD>	<BODY BGCOLOR="#ffffff">		<IMG SRC="gfx/no_icon.jpg" WIDTH="64" HEIGHT="64"><p>		<FONT SIZE="3" FACE="Lucida Grande,Geneva,Arial"><b>Arbejde med widgeter</b></font>		<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial"><p>
		
<i>Widgeter</i> er sm&aring; programmer, der er designet til at k&oslash;re i Apples Dashboard i Mac OS X Tiger. Ved at bruge Amnesty <i>Widget browser</i> kan disse widgeter k&oslash;re p&aring; skrivebordet med udvidede muligheder helt uden for Dashboard (rent faktisk er det slet n&oslash;dvendigt, at Dashboard k&oslash;rer eller er installeret, for at Amnesty kan fungere).
<p> Denne "uafh&aelig;ngighed af Dashboard lader brugere af Mac OS X Panther (10.3.9) k&oslash;re og benytte mange tredieparts widgetertil Dashboard i Amnesty, inden de opgraderer til Tiger.</p>
<p>Widgeter i Amnesty kan tilg&aring;s gennem Amnesty-menuen. HVordan widgeten vises i menuen. afh&aelig;nger af dens <i>tilstand</i>:

<ul><b>Sl&aring;et fra.</b>. Widgeter, der ikke er tilg&aelig;ngelige i &oslash;jeblikket, er gr&aring;. En widget i denne tilstand kan ikke v&aelig;lges. Hvis en widget mangler kristisk information for at kunne k&oslash;re sikkert i Amnesty, eller hvsu den er officielt uunderst&oslash;ttet, vil den altid v&aelig;re i cenne tilstand.</ul>

<ul>
<p><b>K&oslash;rende og synlig.</b> Widgeter, der k&oslash;rer og ogs&aring; er synlige vises med et<i>hak-ikonn</i> til venstre for deres navn. En widget i denne tilstand bruger CPU (Processor) tid og hukommelse.</p>

<p><b>K&oslash;rende og usynlig.</b> Widgeter, der k&oslash;rer; men skjult (ikke synlige på sk&aelig;rmen), vises med et <i>skr&aring;stregikonn</i> til venstre for ders navn. En widget i denne tilstand bruger hukommelse (selvom denne hukommelse ofte er "lagt ud" (og derfor ikke belaster systemet).</p>

<p><b>Lukket.</b> Widgeter, der er lukket (<i>d.v.s.</i> hvrken k&oslash;rer eller synlige) vises uden noget ikon. En widget i denne tilstand bruger ikke af systemets ressourcer.</p>
</ul>
N&aring;r en widget <i>k&oslash;rer og er synlig</i>, kan du interagere med den ved at klikke p&aring; kontroller inden for dens gr&aelig;nser. Eller, hvis du klikker p&aring; statiske dele af widgeten, kan du tr&aelig;kke den omkring p&aring; sk&aelig;rmen og placere den, hvor du vil.p>
			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#edf3fe">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

<b>NB</b>: Hvis du af en eller anden grund ikke kan interagere med en widgets kontroller, s&aring; klik &eacute;n gang p&aring; widgeten og tryk og hold s&aring; <i>&aelig;ble</i>-tasten, mens du klikker p&aring; widgeten. Kan du tilsvarende ikke finde et sted at "fange" widgeten, n&aring;r du vil flytte den, kan du klikke &eacute;n gang p&aring; widgeten og s&aring; holde <i>ALT</i>-tasten neden, mens du klikker p&aring; widgeten og tr&aelig;kker den.
			</FONT></TD>				</TR>			</TABLE></P>

<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
			<P><br><b>&Aring;bne en widget</b><p>			<P>			</FONT>			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#fff8dc">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

V&aelig;lg en <i>lukket</i> widgets navn fra Amnestys menu. 
			</FONT></TD>				</TR>			</TABLE></P>
Amnestys sommerfugle-ikon vil vise, at widgeten &aring;bnes. N&aring; widgeten er klar, vil den vises p&aring; sk&aelig;rmen (centreret p&aring den prim&aelig;re sk&aelig;rm, hvis du ikke tidligere har haft denne widget &aring;ben).
<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
			<P><br><b>Skjule en widget</b><p>			<P>			</FONT>			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#fff8dc">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

V&aelig;lg en <i>k&oslash;rende og synlig</i> widgets navn fra Amnesty-menuen; eller
kontrol-klik p&aring; en widget og v&aelig;lg <b>Skjul</b> p&aring; den popup-menu, der kommer frem.
			</FONT></TD>				</TR>			</TABLE></P>
Widgeten forsvinder fra din sk&aelig;rm.
			</FONT>

<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
			<P><br><b>Vis en skjult widget</b><p>			<P>			</FONT>			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#fff8dc">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

V&aelig;lg en <i>k&oslash;rende og skjult</i> widgets navn fra Amnestys menu.
			</FONT></TD>				</TR>			</TABLE></P>
<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
Widgeten vil igen dukke op p&aring; din sk&aelig;rm.
			</FONT>

<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
			<P><br><b>Luk en widget</b><p>			<P>			</FONT>			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#fff8dc">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

Kontrol-klik p&aring; en widget og v&aelig;lg <b>Luk widget</b> fra popup-menu, der dukker op.
			</FONT></TD>				</TR>			</TABLE></P>
<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
Widgeten vil forsvinde fra din sk&aelig;rm og vil afslutte sig selv.
			</FONT>

<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
			<P><br><b>Opdatere widget</b><p>			I Dashboard vil mange widgeter, der kr&aelig;ver adgang til internettet eller viser en eller anden slags systemstatus, opdatere sig deres informationer, hver gang Dashboard vises (i stedet for effter et bestemt tidsrum).<p>I Amnesty, kan du v&aelig;lge at lade disse widgeter v&aelig;re synlige hele tiden, og resultater er, at widgeterne kun opdateres f&oslash;rste gang den vises. I disse tilf&aelig;de kan du tvinge widgeten til at opdatere sin visning p&aring; et vilk&aring;rligt tidspunkt.			<P>			</FONT>			<P><TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0" WIDTH="100%">				<TR BGCOLOR="#fff8dc">					<TD><FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">

Kontrol-klik en widget og v&aelig; <b>Updatater nu</b> fra den popup-menu, der dukker op.
			</FONT></TD>				</TR>			</TABLE></P>
<FONT SIZE="2" FACE="Lucida Grande,Geneva,Arial">
Hvis widgeten er designet til at opdatere, n&aring;r den vises, opdateres den nu.

	</BODY></HTML>